# 'brew tap'
tap "homebrew/cask"
# 'brew tap' with custom Git URL
tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
brew "git"
brew "tig"
brew "antigen"
brew "openssl"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "zsh"
brew "hub"
brew "imagemagick"
brew "asdf"
brew "diff-so-fancy"
brew "neovim"
brew "tmuxp"
brew "git-recent"

# 'brew install --cask'
cask "iterm2"
cask "kiwi-for-gmail"
cask "obsidian"
cask "skitch"
cask "rubymine"
cask "1password"
cask "alfred"
cask "dash"
cask "google-drive"
cask "kobo"
cask "microsoft-edge"
cask "pocket"
cask "postman"
cask "shiftit"
cask "skype"
cask "slack"
cask "sublime-text"
cask "yujitach-menumeters"

# 'mas install'
# mas "1Password", id: 443987910
