# 'brew tap'
tap "homebrew/cask-fonts"
# 'brew tap' with custom Git URL
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# set arguments for all 'brew install --cask' commands
# cask_args appdir: "~/Applications", require_sha: true
cask_args appdir: "~/Applications"

# 'brew install'
brew "git"
brew "tig"
brew "ctags"
brew "antigen"
brew "openssl"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "zsh"
brew "hub"
brew "imagemagick"
brew "diff-so-fancy"
brew "neovim"
brew "tmuxp"
brew "git-recent"
brew "fzf"

# asdf
brew "openssl"
brew "readline"
brew "ruby-build"

# 'brew install --cask'
cask "iterm2"
cask "kiwi-for-gmail"
cask "obsidian"
cask "skitch"
cask "rubymine"
cask "alfred"
cask "dash"
cask "google-drive"
cask "kobo"
cask "microsoft-edge"
cask "postman"
cask "shiftit"
cask "skype"
cask "slack"
cask "sublime-text"
cask "menumeters"
cask "1password"
cask "docker"
cask "google-cloud-sdk"
cask "openvanilla"
cask "font-meslo-lg-nerd-font"

# 'mas install'
# mas "1Password", id: 1333542190
mas "pocket", id: 568494494
